app/Models/ReportModel.php

    public function getData()
    {
        $builder = $this->db->table($this->table)
            ->select('*')
            ->orderBy('created_at', 'DESC');
        return $builder->get();
---
SELECT *
FROM `reports`
ORDER BY `created_at` DESC