app/Models/UserModel.php

    public function getData()
    {
        $builder = $this->db->table($this->table)
            ->select('*');
        return $builder->get();
---
SELECT *
FROM `user`